posts/im-back.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 03:08 PM on  1 Jan, 2023 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>I'm back!</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
                     <link rel="stylesheet" href="/css/style.css" />
</head>
<body>
<div id="preamble" class="status">
<nav>
    <div>Lighthouse - Michael</div>
    <ul class="navbar">
        <li><a href="/">Home</a></li>
        <li><a href="/">About</a></li>
        <li><a href="/">Github</a></li>
    </ul>
</nav>
</div>
<div id="content">
<h1 class="title">I'm back!</h1>
<div class="PREVIEW">
<p>
So, actually wordpress was blocked for a long time. I have never visit wordpress for THREE years! Although I could jailbreak the <a href="http://en.wikipedia.org/wiki/Golden_Shield_Project">Chinese Great Firewall</a>, I do not update this blog any more in last three years.
</p>

<p>
Just come back and leave some update. and might some useful skill article.
</p>

</div>

<p>
So, actually wordpress was blocked for a long time. I have never visit wordpress for THREE years! Although I could jailbreak the <a href="http://en.wikipedia.org/wiki/Golden_Shield_Project">Chinese Great Firewall</a>, I do not update this blog any more in last three years.
</p>

<p>
Just come back and leave some update. and might some useful skill article.
</p>

<p>
During these three year, I focus on start my own business and pull all my time into learn more in work. At the same time, I get married with Sherry and lucky have a baby this year. Being a father is really a different feeling for me.
</p>

<p>
Thanks to <a href="http://shadowsocks.org/en/index.html">Shadowsocks</a> let me back to the real international rather than staying in intranet in China.
</p>
</div>
<div id="postamble" class="status">
<p class=\"date\">Posted at 12:00 AM on 12 Jul, 2016 </p>
<p class=\"author\">By </p>
</div>
</body>
</html>
